import matplotlib.pyplot as plt
import numpy as np

# 横坐标：1 到 32
x = np.arange(1, 33)

# 两组纵坐标数据
# model_name = 'llama2-7b'
# y1 = [36.5, 37.75, 32.0, 44.5, 29.75, 37.0, 44.5, 30.5, 28.25, 29.75, 42.25, 35.5, 44.0, 35.25, 39.25, 44.5, 31.25, 41.0, 32.5, 36.5, 40.25, 42.75, 25.0, 52.5, 35.5, 45.25, 38.75, 31.0, 40.75, 40.25, 50.5, 35.75]
# y2 = [49.33, 28.67, 28.0, 42.67, 39.0, 39.0, 54.67, 43.67, 42.67, 33.67, 35.33, 35.33, 36.0, 40.67, 63.33, 43.0, 51.33, 42.67, 37.0, 54.33, 57.0, 38.33, 66.33, 50.0, 51.33, 43.0, 51.0, 48.33, 49.33, 59.0, 54.0, 47.0]

# model_name = 'Mistral-7B'
# y1 = [36.25, 30.5, 30.0, 29.25, 40.0, 35.25, 36.0, 31.0, 33.0, 39.0, 17.75, 29.5, 22.75, 37.75, 37.75, 36.75, 38.0, 24.25, 40.75, 28.75, 41.75, 42.25, 27.0, 35.75, 36.25, 31.75, 42.5, 46.0, 47.75, 31.5, 33.25, 35.0]
# y2 = [26.67, 31.67, 30.0, 33.67, 43.33, 44.0, 33.67, 51.0, 32.67, 27.33, 30.0, 43.33, 43.0, 45.67, 52.67, 48.67, 44.0, 41.33, 40.33, 50.67, 49.0, 39.67, 39.33, 45.33, 33.33, 46.67, 54.0, 47.33, 57.33, 50.0, 51.33, 42.0]

model_name = 'LLaMA-3-8B'
grouped_y1 = [286.75, 254.25, 278.5, 304.0]
grouped_y2 = [270.6666666666667, 323.3333333333333, 349.6666666666667, 382.0]

# model_name = 'LLaMA-2-7B'
# grouped_y1 = [37.6875, 35.4375, 33.9375, 40.75, 35.3125, 40.125, 37.625, 41.8125]
# grouped_y2 = [37.166666666666664, 44.083333333333336, 36.75, 45.75, 46.333333333333336, 52.916666666666664, 48.416666666666664, 52.333333333333336]

# model_name = 'Mistral-7B'
# grouped_y1 = [39.5, 33.375, 32.5625, 36.75, 27.25, 30.25, 30.8125, 41.9375]
# grouped_y2 = [27.333333333333332, 33.0, 38.583333333333336, 31.416666666666668, 35.083333333333336, 28.5, 30.583333333333332, 35.166666666666664]


x_labels = ['1~8', '9~16', '17~24', '25~32']
x = np.arange(len(x_labels))  # 0 到 7

# 设置柱宽和偏移
width = 0.35
offset = width / 2

# 创建图像
fig, ax = plt.subplots(figsize=(5, 3))

# 绘制柱状图
ax.bar(x - offset, grouped_y1, width=width, label='MHA', color='skyblue', edgecolor='black',alpha=0.7)
ax.bar(x + offset, grouped_y2, width=width, label='FFN', color='salmon', edgecolor='black',alpha=0.7)

# 设置坐标轴标签和标题
ax.set_xlabel('Layer Range')
ax.set_ylabel('Total Rank of the Submodule')
ax.set_title(f'{model_name}')
ax.set_ylim(150, 450)

# 设置自定义 x 轴标签
ax.set_xticks(x)
ax.set_xticklabels(x_labels)

# 添加图例
ax.legend()

# 保存图像
plt.tight_layout()
# plt.savefig(f'bar_chart-{model_name}-grouped.png', dpi=300)
plt.savefig(f'bar_chart-LLaMA-3-8B-total.pdf', format='pdf', bbox_inches='tight')
plt.close()
