import matplotlib.pyplot as plt
import numpy as np
plt.rcParams.update({'font.size': 13})

# 横坐标：1 到 32
x = np.arange(1, 33)

# 两组纵坐标数据
model_name = 'LLaMA-2-7B'
y1 = [6.0, 5.5, 3.75, 5.25, 3.75, 4.75, 5.25, 4.25, 3.75, 4.0, 4.75, 4.75, 5.25, 4.25, 5.25, 4.75, 3.5, 4.75, 3.75, 4.25, 4.25, 5.0, 3.0, 6.0, 4.5, 5.25, 4.75, 3.5, 4.75, 4.5, 6.0, 4.25]
y2 = [5.67, 3.33, 3.33, 5.0, 4.67, 4.33, 6.33, 5.0, 5.0, 4.0, 4.0, 4.0, 4.67, 5.0, 7.0, 5.33, 6.0, 5.0, 4.33, 7.0, 6.33, 4.67, 7.67, 6.0, 6.0, 5.67, 6.0, 5.0, 5.67, 6.67, 6.33, 6.33]

# model_name = 'Mistral-7B'
# y1 = [6.59, 5.3, 5.45, 5.85, 6.4, 6.13, 5.76, 6.53, 5.5, 6.24, 5.07, 5.13, 5.06, 7.19, 6.04, 6.39, 6.61, 7.46, 7.09, 7.19, 7.59, 6.76, 7.2, 7.53, 7.63, 7.47, 7.39, 7.36, 7.64, 6.3, 7.39, 7.0]
# y2 = [8.0, 7.31, 7.5, 6.73, 6.84, 7.33, 6.73, 7.29, 7.0, 6.83, 6.43, 6.84, 7.17, 7.21, 7.52, 7.3, 6.95, 7.75, 7.12, 7.6, 7.35, 7.93, 7.38, 7.16, 7.14, 7.78, 7.71, 7.89, 7.82, 7.5, 7.33, 6.3]

# model_name = 'LLaMA-3-8B'
# y1 = [6.59, 5.3, 5.52, 5.96, 6.4, 6.08, 5.76, 6.22, 5.5, 6.24, 5.07, 5.13, 5.06, 7.19, 6.04, 6.39, 6.61, 7.46, 7.09, 7.19, 7.59, 6.76, 7.2, 7.53, 7.63, 7.47, 7.39, 7.36, 7.64, 6.3, 7.39, 7.0]
# y2 = [8.0, 7.31, 7.5, 6.73, 6.84, 7.33, 7.0, 7.17, 7.0, 6.83, 6.43, 6.84, 7.17, 7.21, 7.52, 7.3, 6.95, 7.75, 7.12, 7.6, 7.35, 7.93, 7.38, 7.16, 7.14, 7.78, 7.71, 7.89, 7.82, 7.5, 7.33, 6.3]
width = 0.33
offset = width / 2  # 用于左右错开

# 创建画布和坐标轴
fig, ax = plt.subplots(figsize=(12, 3))

# 绘制两组柱状图，错开显示
ax.bar(x - offset, y1, width=width, label='MHA', color='skyblue', edgecolor='black',alpha=0.7)
ax.bar(x + offset, y2, width=width, label='FFN', color='salmon', edgecolor='black',alpha=0.7)

# 设置标签与标题
ax.set_xlabel('Layer Index')
ax.set_ylabel('LoRA Rank')
ax.set_title(f'{model_name}')
ax.set_ylim(0, 10)
# 设置横坐标只显示特定值
xticks_to_show = [1, 5, 9, 13, 17, 21, 25, 29, 32]
plt.xticks(xticks_to_show)

# 添加图例
ax.legend(loc='upper right', fontsize=10)

# 保存图像
plt.tight_layout()
plt.savefig(f'bar_chart-{model_name}-rank.pdf', format='pdf', bbox_inches='tight')
# 不显示图像
plt.close()
